# Описати функцію RectPS (x1, y1, x2, y2, P, S), яка обчислює периметр P і площу S
# прямокутника зі сторонами, паралельними осям координат, за координатами (x1, y1),
# (x2, y2) його протилежних вершин (x1, y1, x2, y2 - вхідні, P і S - вихідні параметри
# дійсного типу). За допомогою цієї функції знайти периметри і площі трьох
# прямокутників з даними протилежними вершинами.


def RectPS(x1, x2, y1, y2):
    a = abs(x1-x2)
    b = abs(y1-y2)
    per = 2*(a+b)
    s = a * b
    return per, s


print("Введіть координати прямокутників")
num1 = int(input("x1: "))
num2 = int(input("x2: "))
num3 = int(input("y1: "))
num4 = int(input("y2: "))

result = RectPS(num1, num2, num3, num4)
print("периметр P і площa S: ", result)
