'''
Описати функцію TriangleP (a, h), що знаходить периметр рівнобедреного трикутника
за його основою a і висотою h, проведеною до основи (a і h - дійсні). За допомогою
цієї функції знайти периметри трьох трикутників, для яких дані основи і висоти. Для
знаходження сторони b трикутника використовувати теорему Піфагора: b2
= (a / 2)^2 +h^2
'''
import math


def TriangleP(a, c):
    b = math.sqrt(pow(a/2, 2) + pow(c, 2))
    p = 2*b + a
    return p


for i in range(3):
    side_a = float(input("Введіть a: "))
    h = float(input("Введіть h: "))
    print(TriangleP(side_a, h))
