'''
Описати функцію DegToRad (D) дійсного типу, яка знаходить величину кута в
радіанах, якщо дана його величина D в градусах (D - дійсне число, 0 ≤ D <360).
Скористатися таким співвідношенням: 180 ° = π радіанів. Як значення π вважати
рівним 3.14. За допомогою функції DegToRad перевести з градусів в радіани п'ять
даних кутів.
'''


def DegToRad(a):
    b = (a / 180) * 3.14
    return b


for i in range(5):
    grad = float(input("Введіть величину кута в градусах:"))
    if 0 <= grad < 360:
        print(DegToRad(grad))
    else:
        print("Ви ввели некоректний кут")
