'''
Описати функцію Sin1 (x, ε) дійсного типу (параметри x, ε - дійсні, ε> 0),
знаходить наближене значення функції sin (x):
sin (x) = x - x
3
/ (3!) + x5
/ (5!) - ... + (-1) n
· x
2 · n + 1 / ((2 · n + 1)!) + ....
В сумі враховувати всі складові, модуль яких більше ε. За допомогою Sin1
знайти наближене значення синуса для даного x при шести даних ε.
'''

def Sin1(x, e):
    s = x
    cx = x
    zx = 1
    t = x
    rez = 0
    k = 1
    while abs(t) > e:
        t = cx / zx
        rez += (-1) * t
        cx *= x
        cx *= x
        k += 1
        zx *= k
        k += 1
        zx *= k
    return rez


arg_x = float(input("Введіть x: "))
for i in range(6):
    arg_e = float(input("Введіть e: "))
    print(Sin1(arg_x, arg_e))
